In [2]:
import pandas as pd

In [3]:
dev_df = pd.read_csv('./dataset/developer_data.csv')
qa_df = pd.read_csv('./dataset/qa_data.csv')

In [4]:
dev_df

   account    amount
0  3127143    3786.5
1  4413248  135718.0
2  4942722    8494.0
3  5519726   19297.0
4  9197174   11784.0
5  9907844    1000.0
6  9907848   56565.0

In [5]:
qa_df

   account   amount
0  3127143   3786.5
1  4413248  13518.0
2  4942722   8494.0
3  5519726  19297.0
4  9197174   1194.0
5  9907844   1000.0

### Data Validation

- Compare the data between two tables and see if they match

In [11]:
def validation(df_1, df_2, primary_col, sec_col):
    df = pd.merge(df_1, df_2, how='outer', on=primary_col)
    df['status'] = df.apply(lambda x: "Pass" if x[f'{sec_col}_x'] == x[f'{sec_col}_y'] else "Fail", axis=1)
    return df

In [12]:
validation(dev_df, qa_df, 'account', 'amount')

   account  amount_x  amount_y status
0  3127143    3786.5    3786.5   Pass
1  4413248  135718.0   13518.0   Fail
2  4942722    8494.0    8494.0   Pass
3  5519726   19297.0   19297.0   Pass
4  9197174   11784.0    1194.0   Fail
5  9907844    1000.0    1000.0   Pass
6  9907848   56565.0       NaN   Fail

In [13]:
from mysql_connector.mysql_connection import df_table

In [14]:
df_table(dataframe=qa_df, database_name='validation', table_name='qa_data')

In [15]:
df_table(dataframe=dev_df, database_name='validation', table_name='dev_data')